<?php

namespace Database\Seeders;

use App\Models\Level;
use App\Models\Option;
use App\Models\Tag;
use App\Models\User;
use Illuminate\Database\Seeder;

class OptionSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $options_data = [
            //oxinchannel
            [
                'title' => 'آموزش همراه زبان فارسی',
                'title_abbr' => 'oxinchannel',
                'icon' => 'icons/oxinchannel.png',
                'intro' => <<<INTRO
                با توجه به تغییرات فناوری و تغییر کاربری تلفن‌های همراه از ابزاری جهت مکالمه به یک دستگاه هوشمند چندکاره، یکی از جدیدترین روش‌های آموزشی، رویکرد یادگیری همراه ( mLearning ) است. نرم‌افزار اکسین نرم‌افزاری است آموزشی برای یادگیری زبان فارسی از طریق موبایل ( MALL ). این نرم‌افزار با همکاری شرکت اکسین تهیه شده است و محتوای آموزشی آن مطابق با کتاب گام اول بنیاد سعدی و مناسب سطح نوآموز است. محتوای این نرم‌افزار طبق الگویی مشخص برای روزهای هفته آماده شده است و به صورت هفته به هفته در قالب سه بخش آماده ‎ سازی، یادگیری و تمرین ارائه می‌گردد. همه واژه‌های جدید هفته در روز اول، مکالمه ‎ ای کاربردی و نکات آن در روز دوم، آموزش و تمرین سه حرف یا صدای زبان فارسی در روزهای سوم، چهارم و پنجم، مرور آموزش هفته در روز ششم و آزمونک برای ارزیابی و تثبیت یادگیری محتوای آموزشی در روز هفتم برنامه‌ریزی شده‌است. محتوای آموزشی در بخش آماده‌سازی به زبان انگلیسی و در بخش یادگیری به زبان فارسی ارائه می‌شود. مدت زمان این بخش‌ها بسته به سطح و محتوای آموزشی متفاوت است؛ البته مجموع همه بخش‌های روزانه آن نهایتاً حدود ده دقیقه است.
                INTRO,
                'intro_video' => 'A3TDn',
                'main_link' => 'https://persian.oxinchannel.app',
                'levels' => [
                    Level::firstWhere('title_abbr', 'n'),
                ],
                'tags' => null,
            ],
            //multimedia
            [
                'title' => 'آموزش چند رسانه ای تعاملی زبان فارسی (گام اول)',
                'title_abbr' => 'multimedia',
                'icon' => 'icons/multimedia.png',
                'intro' => <<<INTRO
                یکی از بهترین روش‌ها جهت افزایش بازده آموزشی، استفاده از محتوای چندرسانه‌ای (Multimedia) در رابطه با موضوع آموزشی موردنظر است. محتوای چندرسانه‌ای می‌تواند بصورت آنلاین (تحت وب) یا آفلاین (در سی‌دی) طراحی، تولید و ارائه شود. چندرسانه‌ای‌بودن محتوا به دلیل استفاده از رسانه‌های گوناگون مانند فیلم، عکس، صوت و متن در تولید این نوع نرم‌افزارها است.
                استفاده از محتوای چندرسانه‌ای مزیت‌های فراوانی دارد از جمله: استفاده از تصاویر ثابت یا متحرک یا فیلم به‌جای نوشته؛ استفاده از صوت و موسیقی همراه آموزش؛ استفاده از ابزار تفریحی و بازی‌های مختلف جهت جلوگیری از بروز خستگی؛ تحریک حافظه تصویری افراد و افزایش بازده آموزشی؛ یادگیری سریع‌تر، مؤثرتر و پایدارتر؛ انجام و نمایش کارهایی که در حالت عادی امکان انجام آنها وجود ندارد؛ صرفه‌جویی در هزینه آموزشی و زمان کاربران.
                محتوای طراحی‌شده در بنیاد سعدی علاوه بر چندرسانه‌ای‌بودن، ویژگی مهم تعاملی‌بودن را نیز دارد. هدف این محتوا صرفاً ارائه مطالب آموزشی نیست، بلکه کاربران با تعامل با محتوا، موضوعات موردنظر را تمرین کرده و بازخورد فعالیت‌های خود را در همان زمان دریافت می‌‌کنند.
                تکنولوژی آموزشی و گرافیک محتوای چندرسانه‌ای تعاملی کتاب گام اول، اولین بار توسط متخصصین آزفا (آموزش زبان فارسی به غیر فارسی‌زبانان) برای آموزش زبان فارسی در سطح نوآموز طراحی شده‌است.
                INTRO,
                'intro_video' => null,
                'main_link' => 'https://s1f.ir/1stemdownload',
                'levels' => [
                    Level::firstWhere('title_abbr', 'n'),
                ],
                'tags' => null,
            ],
            //mina
            [
                'title' => 'آموزش وب‌محور زبان فارسی (مینا)',
                'title_abbr' => 'mina',
                'icon' => 'icons/mina.png',
                'intro' => <<<INTRO
                سامانه آموزش مجازی مینا، با هدف ارائه محتوای آموزشی ساختارمند و منطبق با استاندارد آموزشی بنیاد سعدی برای علاقمندان به زبان فارسی در سراسر دنیا طراحی شده‌است. افرادی که امکان شرکت در کلاس‌های حضوری زبان فارسی را ندارند، می‌توانند مطابق با زمان و شرایط خود دوره‌های این سامانه را به‌صورت خودآموز بگذرانند و پیشرفت خود را در تسلط بر دانش و مهارت‌های زبان فارسی بسنجند. محتوای آموزشی این سامانه، مطابق با ۳۲۰ ساعت آموزش حضوری است و شامل مواد آموزشی برای تمام مهارت‌ها و مؤلفه‌های زبان است. در ابتدای ورود به این سامانه، کاربر در یک آزمون تعیین‌سطح برخط شرکت می‌کند و بر اساس نتیجه آن به درس‌های آموزشی مناسب سطح خود هدایت می‌شود.
                در این سامانه، زبان‌آموز ضمن انجام تمرین‌های تشخیصی، تقویت دانش و مهارت‌‌های ادراکی خود، می‌تواند تمرین‌های تولید گفتار نیز انجام دهد. از آنجایی که سامانه مجهز به موتور تشخیص گفتار است، زبان‌آموز ضمن تکرار جمله و تشخیص میزان درستی تلفظ خود، می‌تواند با پذیرفتن نقش‌های مختلف، صحبت کند و میزان درستی گفتار خود را مشاهده کند.
                INTRO,
                'intro_video' => null,
                'main_link' => 'https://mina.saadifoundation.ir',
                'levels' => [
                    Level::firstWhere('title_abbr', 'a'),
                    Level::firstWhere('title_abbr', 'b1'),
                    Level::firstWhere('title_abbr', 'b2'),
                    Level::firstWhere('title_abbr', 'b3'),
                ],
                'tags' => null,
            ],
            //framework
            [
                'title' => 'آموزش وب محور زبان فارسی (چارچوب)',
                'title_abbr' => 'framework',
                'icon' => 'icons/framework.png',
                'intro' => <<<INTRO
                بسته آموزش مجازی چارچوب، منطبق با استاندارد آموزشی بنیاد سعدی، یک دورۀ کامل فارسی‌آموزی از سطح مقدماتی تا پایان پیش‌میانی، در اختیار علاقه‌مندان قرار می‌دهد. این دورۀ آموزشی هر چهار مهارت فارسی‎آموزان را با تمرکز بر آموزش «دستور» تقویت می ‎ کند. فارسی‌آموزان به راحتی در محیط وب و با گوشی موبایل، محتوای کامل کتاب چارچوب را به کمک بیش از ۱۰۰ فیلم آموزشی کوتاه فرامی‎گیرند و در یک فضای تعاملی به صورت همزمان و غیرهمزمان از پشتیبانی مدرسان مجرب بهره‌مند می‌‌شوند. همچنین مدرسان می‌توانند با بهره‌گیری از امکانات مدیریتی این سامانه، کلاس‌های حضوری خود را پربارتر کنند و به تکالیف زبان‎آموزان خود به صورت الکترونیکی بازخورد اصلاحی بدهند.
                محتوای بستۀ آموزش مجازی چارچوب، بر اساس کارکردهای زبانی، شامل ۳۵ درس است و از نظر ساخت دستوری در ۱۲ فصل طبقه ‎ بندی شده اند. موضوعات درسی تمام درس‌ها ساختار مشابهی دارند؛ هر درس با مهارتهای ادراکی آغاز می‌شود و زبان‎ آموز پس از مشاهده فیلم‌های آموزشی و حل تمرین‌های تشخیصی و نیمه ‎تشخیصی قادر خواهد بود، در پایان درس به راحتی ساخت‌های دستوری مربوطه را در تمرین‌های تولیدی به‌کار گیرد.
                INTRO,
                'intro_video' => null,
                'main_link' => 'https://persiangrammar.saadifoundation.ir',
                'levels' => [
                    Level::firstWhere('title_abbr', 'a'),
                ],
                'tags' => null,
            ],
            //vajeh-yabi
            [
                'title' => 'نرم افزار واژه یابی',
                'title_abbr' => 'vajeh-yabi',
                'icon' => 'icons/vajeh-yabi.png',
                'intro' => <<<INTRO
                نرم ‎ افزار واژه ‎ یابی یک ابزار کمک ‎ آموزشی برای همه کسانی است که می ‎ خواهند دامنه لغات زبان فارسی خود را تقویت کنند. همه کسانی که با زبان فارسی در حد پیش‌میانی و بالاتر آشنا باشند، می‌‏توانند با استفاده از این نرم ‎ افزار، واژه ‎ های بسیاری را در درون جملات صحیح بیاموزند. محتوای این نرم ‎ افزار برای زبان ‎ آموزان سطح پیش ‎ میانی و میانی مناسب است که در دوازده حوزه واژگانی، مجموعاً ۱۸۰ گام دارد. هر حوزه واژگانی به تعداد ۵ ± ۱۵ گام دارد که در هر گام زبان‌آموز باید یک واژه را پیدا کند. در هر گام از بازی، کاربران به کمک عنوان حوزه واژگانی و بافت جمله و تعداد خانه‌های خالی حروف و حروف ارائه‌شده در جدول حروف به پاسخ درست می ‎ رسند. در صورتی که کاربر موفق به پیدا‌کردن واژه موردنظر نشود، می ‎ تواند از بخش راهنما کمک بگیرد. در این بخش با کسر تعدادی امتیاز از کاربر، به وسیله یکی از این روش‌ها کاربر راهنمایی می ‎ شود: ارائه تصویر واژه موردنظر، ارائه معادل انگلیسی واژه، و ارائه توضیح فارسی در مورد واژه.
                INTRO,
                'intro_video' => null,
                'main_link' => 'https://play.google.com/store/apps/details?id=com.navidokht.persian',
                'levels' => [
                    Level::firstWhere('title_abbr', 'a'),
                ],
                'tags' => null,
            ],
            //vajeh-bazi
            [
                'title' => 'نرم افزار واژه بازی ۱ و ۲',
                'title_abbr' => 'vajeh-bazi',
                'icon' => 'icons/vajeh-bazi.png',
                'intro' => <<<INTRO
                واژه‌بازی به دو صورت یک نفره (مرحله ای) و رقابتی (آنلاین) طراحی شده‌است. واژه‌بازی یک بازی فکری است که نیازمند هوش بالا، حافظه قوی و آشنایی با کلمات مختلف فارسی است. در این بازی شما می‌بایست با کشیدن انگشت روی جدول، کلمات معنادار را پیدا کرده و به نسبت تعداد حروف آنها امتیاز کسب کنید. حالت یک‌نفره این بازی هم به‌صورت امتیازی و هم به‌صورت مرحله‌ای است، بنابراین هم می‌توانید با کسب امتیاز بالا رکورد خود را ثبت کنید و هم مراحل بازی را طی کنید تا به مرحله آخر برسید. در این بازی، ۴۵۵ مرحله وجود دارد که در هر مرحله سه کلمه خاص به شما ارائه می‌شود تا آنها را در جدول پیدا کنید، مرحله اول با کلمات ساده دوحرفی شروع می‌شود تا مرحله آخر که می‌بایست کلمات سخت چهارده‌حرفی را پیدا کنید. در حالت رقابتی در این بازی می‌توانید با کسب امتیاز به‌صورت آنلاین با دیگران رقابت کنید، چنانچه با کلمات فارسی بیشتری آشنایی داشته و همچنین از هوش بالاتر و حافظه قوی‌تری برخوردار باشید، می‌توانید رتبه بهتری کسب نمایید. در این حالت، در هر روز یک جدول مشترک به همه نمایش داده می‌شود و امتیازات کسب‌شده فقط مربوط به همان جدول است، بنابراین هر روز یک رقابت جدید با یک جدول جدید پیش رو خواهید داشت.
                INTRO,
                'intro_video' => null,
                'main_link' => 'https://play.google.com/store/apps/details?id=com.shahmiri.vazhehbazi',
                'levels' => [
                    Level::firstWhere('title_abbr', 'a'),
                ],
                'tags' => null,
            ],
            //persian-with-music
            [
                'title' => 'آموزش زبان فارسی با موسیقی',
                'title_abbr' => 'persian-with-music',
                'icon' => 'icons/persian-with-music.png',
                'intro' => <<<INTRO
                موسیقی یکی از راه‌های موثر در یادگیری زبان است. در این پروژه، قرار است فارسی‌آموزان با کمک حدود ۵۰ موسیقی، زبان‌فارسی را با لذت بیشتر بیاموزند. آهنگ‌ها از سبک‌ها، خواننده‌ها و موضوع‌های مختلف انتخاب شده‌اند. در انتخاب آهنگ‌ها سعی شده ملاک‌های آموزشی مختلفی مدنظر قرار گیرد از جمله ساده بودن متن شعر، استفاده از واژه‌های روزمره، استفاده نکردن از واژه‌های مهجور و قدیمی، خواندن شعر به‌صورت واضح و وجود مفاهیم ارزشمند. قرار است در کنار هر موسیقی و متن آن، تمرین‌هایی هم برای یادگیری زبان فارسی ارائه شود.
                INTRO,
                'intro_video' => null,
                'main_link' => null,
                'levels' => [
                    Level::firstWhere('title_abbr', 'b1'),
                    Level::firstWhere('title_abbr', 'b2'),
                    Level::firstWhere('title_abbr', 'b3'),
                ],
                'tags' => null,
            ],
            //vajeh-mina
            [
                'title' => 'نرم افزار واژه مینا',
                'title_abbr' => 'vajeh-mina',
                'icon' => 'icons/vajeh-mina.png',
                'intro' => <<<INTRO
                نرم ‎ افزار مینا یک ابزار کمک ‎ آموزشی برای همه کسانی است که می ‎ خواهند دامنه لغات زبان فارسی خود را تقویت کنند. همه کسانی که با زبان فارسی در حد مبتدی آشنا باشند، می توانند با این نرم ‎ افزار واژه‌های زیادی بیاموزند. محتوای نرم ‎ ‌افزار شامل حدود ۱۲۰۰ واژه‏ است که جزء پرکاربردترین واژه‌های زبان فارسی هستند. این نرم‌افزار دوزبانه است. انتقال مفاهیم و آموزش با ارائه معادل انگلیسی واژه‌ها، آوانوشت آنها به همراه تصویر و صوت صورت می‌گیرد. در مجموع ۱۴ حوزه واژگانی و بیش از ۷۰ درس در نظر گرفته شده‌است. هر درس نیز ۱۰ نوع فعالیت را دربردارد که هر فعالیت شامل حدود ۲۰ تکلیف است؛ هر حوزه نیز آزمونی جداگانه دارد و امکان مرور درس‌ها فراهم گشته‌است. هر حوزه شامل چند درس است که کاربر با انتخاب یکی از درس‌ها وارد مرحله واژه‌آموزی و فعالیت ‎ ها می ‎ شود. در این مرحله ۱۰ نوع فعالیت وجود دارد که در تمام این فعالیت ‎ ها، کاربر واژه‌های آن درس مربوط را به شکل ‎ های متنوعی تکرار و تمرین می‌کند. هر کدام از این فعالیت‏ها با ویژگی خاصی طراحی شده‌است و اهداف خاصی دارند که چینش فعالیت‌ها، از فعالیت اول تا دهم از ساده به دشوار بوده ‎ است.
                INTRO,
                'intro_video' => null,
                'main_link' => 'https://saadifoundation.ir/file/download/download/1579076520-mina-avvalmarketrelease2.zip',
                'levels' => [
                    Level::firstWhere('title_abbr', 'b1'),
                    Level::firstWhere('title_abbr', 'b2'),
                    Level::firstWhere('title_abbr', 'b3'),
                ],
                'tags' => null,
            ],
            //videos
            [
                'title' => 'ویدیوهای آموزشی',
                'title_abbr' => 'videos',
                'icon' => 'icons/videos.png',
                'intro' => <<<INTRO
                ویدئوهای آموزشی یکی از متداول‌ترین روش‌های آموزشی هستند که هم‌اکنون در بزرگترین سامانه‌های آموزش مجازی در دنیا مورد استفاده قرار می‌گیرند. تلفیق ویدئو با محتوا آموزشی با روش موشن‌گرافیک از جدیدترین وتخصصی‌ترین نوع ویدئوهای آموزشی است. جهت تولید این ویدئوها، هر جلسه کلاسی به چندین قطعه ویدئوی ۵ تا ۱۰ دقیقه‌ای تقسیم، و مطالب دوره در استودیوی بنیاد سعدی ضبط شده‌است. سپس یک متخصص آزفا و یک تکنولوژیست آموزشی متن تدریس را پیاده‌سازی می‌کنند و سناریوی ویدئو را می‌نویسند. سناریو تحویل تیم موشن‌گرافیک و تدوین فیلم قرار گرفته و پس از حداقل دو مرحله بازبینی و اصلاح در نهایت محتوایی غنی، که تلفیقی از ویدئوی استاد دوره و موشن‌گرافیک محتوای آموزشی است، تولید می‌گردد. علاوه بر این جهت پاسخگویی به نیاز فراگیران، زیرنویس فارسی ویدئو نیز تهیه می‌شود و همراه هر قطعه ارائه می‌گردد. از این ویدئوها هم به‌صورت مستقل و هم به‌عنوان محتوای اصلی دوره‌های مجازی غیرهمزمان استفاده می‌شود.
                در حال حاضر مجموعه ویدئوهای دوره غیرهمزمان روش تدریس زبان فارسی که شامل ۵۴ قطعه ویدئو و در مجموع حدود ۹ ساعت است، تهیه شده‌است. در مراحل بعدی، ویدئو‌های دوره‌های کوتاه‌مدت آموزشی و قطعه‌های کوتاه یادگیری ( Micro Learning ) در بنیاد سعدی نیز طراحی و تدوین خواهدشد.
                INTRO,
                'intro_video' => null,
                'main_link' => null,
                'levels' => null,
                'tags' => [
                    'how-to-teach'
                ],
            ],
            //e-books
            [
                'title' => 'کتاب های الکترونیکی',
                'title_abbr' => 'e-books',
                'icon' => 'icons/e-books.png',
                'intro' => <<<INTRO
                کتاب ایران‌شناسی در قالب برنامه درسی محتوامحور تهیه و تدوین شده‌است. مخاطبان اصلی این کتاب دانشجویان خارجی رشته ایران‌شناسی و شرق‌شناسی و زبان‌آموزان سطوح میانی و فوق‌میانی هستند. همچنین کتاب لذت خواندن با بهره‌گیری از انگاره نیل اندرسون، به آموزش و تقویت مهارت خواندن می‌پردازد. این کتاب مناسب زبان‌آموزان سطوح پیش‌میانی و میانی است. بنیاد سعدی علاوه بر تألیف این دو کتاب و سی‌دی صوتی آموزشی آن، نسخه الکترونیکی آنها را نیز تهیه کرده‌است. این نسخه الکترونیکی چندرسانه‌ای به زبان‌آموز این امکان را می‌دهد که در صورت عدم‌دسترسی به کتاب بتواند متون کتاب را خوانده و به آنها گوش دهد. این نسخه الکترونیکی حاوی تمام متن‌های کتاب و فایل صوتی آنها است. زبان‌آموز در قسمت خانه، نام فصل‌ها و درس‌های آن را می‌بیند و می‌تواند درس موردنظر خود را انتخاب کند. زبان‌آموز علاوه بر گوش‌دادن به فایل صوتی، می‌تواند متن را مشاهده کند و همراه گوینده متن را بخواند. در صفحه مربوط به هر متن امکاناتی از جمله کلید توقف، جلو بردن و عقب بردن متن برای زبان‌آموز فراهم است.
                INTRO,
                'intro_video' => null,
                'main_link' => null,
                'levels' => null,
                'tags' => [
                    'enrichment',
                ],
            ],
            //books-audio
            [
                'title' => 'فایل صوتی کتاب های چاپی',
                'title_abbr' => 'books-audio',
                'icon' => 'icons/books-audio.png',
                'intro' => <<<INTRO
                با توجه به نقش کلیدی مهارت شنیدن در مراحل اولیه زبان‌آموزی، برای هر یک از کتاب‌های بنیاد سعدی، مجموعه فایل‌های صوتی مرتبط نیز ضبط و آماده شده‌است. فایل‌های صوتی منطبق با اهداف آموزشی کتاب است و جهت کمک به انتقال یادگیری به دنیای واقعی از سبک گفتگوهای محاوره‌ای استفاده شده‌است.
                با راه‌اندازی استودیو در بنیاد سعدی، فایل‌های صوتی در این استودیو ضبط می‌گردد. جهت استفاده از این فایل‌ها می‌توان با اسکن کد مشخص در کتاب به سایت بنیاد سعدی متصل شد و فایل‌های مرتبط را دانلود کرد.
                INTRO,
                'intro_video' => null,
                'main_link' => null,
                'levels' => null,
                'tags' => [
                    'enrichment',
                ],
            ],
            //synch-learning
            [
                'title' => 'آموزش برخط همزمان',
                'title_abbr' => 'synch-learning',
                'icon' => 'icons/synch-learning.png',
                'intro' => <<<INTRO
                در راستای تسهیل آموزش زبان فارسی و گسترش آن، بنیاد سعدی امکان برگزاری کلاس‌های مجازی همزمان (synchronous) را فراهم آورده‌است. در این کلاس‌ها، استاد و دانشجو در یک زمان مشخص ولی در مکان دلخواه از طریق اینترنت وارد سامانه بنیاد سعدی می‌شوند و طبق راهنماهای موجود به کلاس متصل می‌شوند و شروع به فعالیت می‌نمایند. اساتید این دوره‌ها، متخصصین آزفا هستند. در هر کلاس، علاوه بر استاد یک تسهیل‌گر که دوره تخصصی آموزش در فضای مجازی را گذرانده است نیز حضور دارد. تسهیل‌گر علاوه بر حمایت استاد، فعالیت‌های یادگیرندگان حاضر در کلاس را نیز مدیریت نماید. علاوه بر استاد و تسهیل‌گر، پشتیبانان آموزشی و فنی نیز قبل و هنگام برگزاری دوره یادگیرندگان را جهت اتصال و حفظ ارتباط با دوره حمایت می‌کنند.
                هم‌اکنون امکان برگزاری دوره‌های مجازی همزمان در دو گروه آموزش زبان‌فارسی و روش تدریس زبان فارسی وجود دارد.
                INTRO,
                'intro_video' => null,
                'main_link' => null,
                'levels' => null,
                'tags' => [
                    'infrastructure',
                ],
            ],
        ];
        foreach ($options_data as $option_data) {
            $option = new Option;
            $option->title = $option_data['title'];
            $option->title_abbr = $option_data['title_abbr'];
            $option->icon = $option_data['icon'];
            $option->intro = $option_data['intro'];
            $option->intro_video = $option_data['intro_video'];
            $option->main_link = $option_data['main_link'];
            $option->save();

            if ($option_data['levels'] !== null) {
                $option->levels()->saveMany($option_data['levels']);
            }

            if ($option_data['tags'] !== null) {
                foreach ($option_data['tags'] as $tag) {
                    $option->tags()->save(Tag::firstWhere('title_abbr', $tag));
                }
            }
        }
    }
}
