<?php

namespace Database\Seeders;

use App\Models\Level;
use App\Models\Option;
use App\Models\Tag;
use App\Models\User;
use Illuminate\Database\Seeder;

class OptionSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $options_data = [
            //oxinchannel
            [
                'title' => 'آموزش همراه زبان فارسی',
                'title_abbr' => 'oxinchannel',
                'icon' => 'icons/oxinchannel.png',
                'intro' => <<<INTRO
                <p>
                با توجه به تغییرات فناوری و تغییر کاربری تلفن‌های همراه از ابزاری جهت مکالمه به یک دستگاه هوشمند چندکاره، یکی از جدیدترین روش‌های آموزشی، رویکرد یادگیری همراه ( mLearning ) است. نرم‌افزار اکسین نرم‌افزاری است آموزشی برای یادگیری زبان فارسی از طریق موبایل ( MALL ). این نرم‌افزار با همکاری شرکت اکسین تهیه شده است و محتوای آموزشی آن مطابق با کتاب گام اول بنیاد سعدی و مناسب سطح نوآموز است. محتوای این نرم‌افزار طبق الگویی مشخص برای روزهای هفته آماده شده است و به صورت هفته به هفته در قالب سه بخش آماده ‎ سازی، یادگیری و تمرین ارائه می‌گردد. همه واژه‌های جدید هفته در روز اول، مکالمه ‎ ای کاربردی و نکات آن در روز دوم، آموزش و تمرین سه حرف یا صدای زبان فارسی در روزهای سوم، چهارم و پنجم، مرور آموزش هفته در روز ششم و آزمونک برای ارزیابی و تثبیت یادگیری محتوای آموزشی در روز هفتم برنامه‌ریزی شده‌است. محتوای آموزشی در بخش آماده‌سازی به زبان انگلیسی و در بخش یادگیری به زبان فارسی ارائه می‌شود. مدت زمان این بخش‌ها بسته به سطح و محتوای آموزشی متفاوت است؛ البته مجموع همه بخش‌های روزانه آن نهایتاً حدود ده دقیقه است.
                </p>
                <h2>
                ویژگی‌های اصلی
                </h2>
                <ol>
                <li>
                آماده‌سازی زبان‌آموز با محتوای موردنظر به زبان اول
                </li>
                <li>
                ارتباط غیرمستقیم زبان‌آموز با گویشور زبان مقصد به عنوان مدرس
                </li>
                <li>
                تکرار و تمرین آیتم آموزشی
                </li>
                <li>
                ارتباط کوتاه، مختصر و مفید زبان‌آموز با محتوای آموزشی
                </li>
                <li>
                در دسترس بودن و سهولت ارتباط دائمی با یادگیری و آموزش از طریق تلفن همراه
                </li>
                <li>
                امکان ارتباط مستقیم با مدرس زبان فارسی از طریق مدرس برخط
                </li>
                </ol>
                INTRO,
                'intro_video' => 'A3TDn',
                'main_link' => 'https://persian.oxinchannel.app',
                'levels' => [
                    Level::firstWhere('title_abbr', 'n'),
                ],
                'tags' => null,
            ],
            //multimedia
            [
                'title' => 'آموزش چند رسانه ای تعاملی زبان فارسی (گام اول)',
                'title_abbr' => 'multimedia',
                'icon' => 'icons/multimedia.png',
                'intro' => <<<INTRO
                <p>
                یکی از بهترین روش‌ها جهت افزایش بازده آموزشی، استفاده از محتوای چندرسانه‌ای (Multimedia) در رابطه با موضوع آموزشی موردنظر است. محتوای چندرسانه‌ای می‌تواند بصورت آنلاین (تحت وب) یا آفلاین (در سی‌دی) طراحی، تولید و ارائه شود. چندرسانه‌ای‌بودن محتوا به دلیل استفاده از رسانه‌های گوناگون مانند فیلم، عکس، صوت و متن در تولید این نوع نرم‌افزارها است.
                </p>
                <p>
                استفاده از محتوای چندرسانه‌ای مزیت‌های فراوانی دارد از جمله: استفاده از تصاویر ثابت یا متحرک یا فیلم به‌جای نوشته؛ استفاده از صوت و موسیقی همراه آموزش؛ استفاده از ابزار تفریحی و بازی‌های مختلف جهت جلوگیری از بروز خستگی؛ تحریک حافظه تصویری افراد و افزایش بازده آموزشی؛ یادگیری سریع‌تر، مؤثرتر و پایدارتر؛ انجام و نمایش کارهایی که در حالت عادی امکان انجام آنها وجود ندارد؛ صرفه‌جویی در هزینه آموزشی و زمان کاربران.
                </p>
                <p>
                محتوای طراحی‌شده در بنیاد سعدی علاوه بر چندرسانه‌ای‌بودن، ویژگی مهم تعاملی‌بودن را نیز دارد. هدف این محتوا صرفاً ارائه مطالب آموزشی نیست، بلکه کاربران با تعامل با محتوا، موضوعات موردنظر را تمرین کرده و بازخورد فعالیت‌های خود را در همان زمان دریافت می‌‌کنند.
                </p>
                <p>
                تکنولوژی آموزشی و گرافیک محتوای چندرسانه‌ای تعاملی کتاب گام اول، اولین بار توسط متخصصین آزفا (آموزش زبان فارسی به غیر فارسی‌زبانان) برای آموزش زبان فارسی در سطح نوآموز طراحی شده‌است.
                </p>
                <h2>
                ویژگی‌های اصلی
                </h2>
                <ol>
                <li>
                استفاده در دو حالت برخط و غیر برخط (آنلاین و آفلاین)
                </li>
                <li>
                استفاده از متن، تصویر، صوت و فیلم در طراحی با الگوهای طراحی مطرح جهانی (مایر و مریل)
                </li>
                <li>
                طراحی تعاملی و دوسویه برای فعال‌کردن زبان‌آموز
                </li>
                <li>
                ارائۀ بازخورد فوری
                </li>
                <li>
                ارائه مثال و تمرین‌های منحصربه‌فرد برای یادگیری حروف الفبا و کلمات فارسی
                </li>
                <li>
                نمایش نقشه مسیر یادگیری در هر مرحله
                </li>
                <li>
                آزمون انتهای هر جلسه به همراه تصحیح و ارائه نمره
                </li>
                <li>
                طراحی با به‌روزترین و قوی‌ترین نرم‌افزارها
                </li>
                </ol>
                INTRO,
                'intro_video' => 'j5Om8',
                'main_link' => 'https://s1f.ir/1ststepdownload',
                'levels' => [
                    Level::firstWhere('title_abbr', 'n'),
                ],
                'tags' => null,
            ],
            //mina
            [
                'title' => 'آموزش وب‌محور زبان فارسی (مینا)',
                'title_abbr' => 'mina',
                'icon' => 'icons/mina.png',
                'intro' => <<<INTRO
                <p>
                سامانه آموزش مجازی مینا، با هدف ارائه محتوای آموزشی ساختارمند و منطبق با استاندارد آموزشی بنیاد سعدی برای علاقمندان به زبان فارسی در سراسر دنیا طراحی شده‌است. افرادی که امکان شرکت در کلاس‌های حضوری زبان فارسی را ندارند، می‌توانند مطابق با زمان و شرایط خود دوره‌های این سامانه را به‌صورت خودآموز بگذرانند و پیشرفت خود را در تسلط بر دانش و مهارت‌های زبان فارسی بسنجند. محتوای آموزشی این سامانه، مطابق با ۳۲۰ ساعت آموزش حضوری است و شامل مواد آموزشی برای تمام مهارت‌ها و مؤلفه‌های زبان است. در ابتدای ورود به این سامانه، کاربر در یک آزمون تعیین‌سطح برخط شرکت می‌کند و بر اساس نتیجه آن به درس‌های آموزشی مناسب سطح خود هدایت می‌شود.
                </p>
                <p>
                در این سامانه، زبان‌آموز ضمن انجام تمرین‌های تشخیصی، تقویت دانش و مهارت‌‌های ادراکی خود، می‌تواند تمرین‌های تولید گفتار نیز انجام دهد. از آنجایی که سامانه مجهز به موتور تشخیص گفتار است، زبان‌آموز ضمن تکرار جمله و تشخیص میزان درستی تلفظ خود، می‌تواند با پذیرفتن نقش‌های مختلف، صحبت کند و میزان درستی گفتار خود را مشاهده کند.
                </p>
                <h2>
                ویژگی‌های اصلی
                </h2>
                <ol>
                <li>
                ارائه محتوای آموزشی در چهار مهارت خواندن، شنیدن، صحبت‌کردن و نوشتن و چهار مؤلفه تلفظ، واژه، دستور و کارکرد
                </li>
                <li>
                امکان استفاده از درس‌های سامانه به دلخواه زبان‌آموز
                </li>
                <li>
                امکان دانلود فایل‌های صوتی برای تمرین بیشتر و تقویت مهارت شنیداری
                </li>
                <li>
                امکان ضبط صدا و تشخیص درستی تلفظ
                </li>
                <li>
                امکان تولید پاره‌گفتار جمله توسط زبان‌آموز، ضبط صدا و تشخیص درستی گفتار او
                </li>
                <li>
                امکان ارزیابی یادگیری در انتهای هر درس
                </li>
                <li>
                برگزاری جلسات همزمان مجازی با یک مربی
                </li>
                <li>
                آزمون تعیین‌سطح جهت تعیین اولین مرحله آموزشی
                </li>
                </ol>
                INTRO,
                'intro_video' => 'pZleQ',
                'main_link' => 'https://mina.saadifoundation.ir',
                'levels' => [
                    Level::firstWhere('title_abbr', 'a'),
                    Level::firstWhere('title_abbr', 'b1'),
                    Level::firstWhere('title_abbr', 'b2'),
                    Level::firstWhere('title_abbr', 'b3'),
                ],
                'tags' => null,
            ],
            //framework
            [
                'title' => 'آموزش وب محور زبان فارسی (چارچوب)',
                'title_abbr' => 'framework',
                'icon' => 'icons/framework.png',
                'intro' => <<<INTRO
                <p>
                بسته آموزش مجازی چارچوب، منطبق با استاندارد آموزشی بنیاد سعدی، یک دورۀ کامل فارسی‌آموزی از سطح مقدماتی تا پایان پیش‌میانی، در اختیار علاقه‌مندان قرار می‌دهد. این دورۀ آموزشی هر چهار مهارت فارسی‎آموزان را با تمرکز بر آموزش «دستور» تقویت می ‎ کند. فارسی‌آموزان به راحتی در محیط وب و با گوشی موبایل، محتوای کامل کتاب چارچوب را به کمک بیش از ۱۰۰ فیلم آموزشی کوتاه فرامی‎گیرند و در یک فضای تعاملی به صورت همزمان و غیرهمزمان از پشتیبانی مدرسان مجرب بهره‌مند می‌‌شوند. همچنین مدرسان می‌توانند با بهره‌گیری از امکانات مدیریتی این سامانه، کلاس‌های حضوری خود را پربارتر کنند و به تکالیف زبان‎آموزان خود به صورت الکترونیکی بازخورد اصلاحی بدهند.
                </p>
                <p>
                محتوای بستۀ آموزش مجازی چارچوب، بر اساس کارکردهای زبانی، شامل ۳۵ درس است و از نظر ساخت دستوری در ۱۲ فصل طبقه ‎ بندی شده اند. موضوعات درسی تمام درس‌ها ساختار مشابهی دارند؛ هر درس با مهارتهای ادراکی آغاز می‌شود و زبان‎ آموز پس از مشاهده فیلم‌های آموزشی و حل تمرین‌های تشخیصی و نیمه ‎تشخیصی قادر خواهد بود، در پایان درس به راحتی ساخت‌های دستوری مربوطه را در تمرین‌های تولیدی به‌کار گیرد.
                </p>
                <h2>
                ویژگی‌های اصلی
                </h2>
                <ol>
                <li>
                داشتن برنامۀ درسی دقیق و نقشۀ محتوایی مشخص
                </li>
                <li>
                سادگی ساختار و محتوا
                </li>
                <li>
                وجود فیلم‌های آموزشی کوتاه
                </li>
                <li>
                چینش محتوا بر اساس پرکاربردترین کارکردهای زبانی
                </li>
                <li>
                تمرکز بر هر چهار مهارت زبانی و فعالیت‌هایی در راستای تقویت آنها
                </li>
                <li>
                پشتیبانی علمی مدرسان از زبان ‎آموزان در تمام طول دوره، در فضایی تعاملی به صورت همزمان و غیرهمزمان
                </li>
                <li>
                امکان ارائۀ بازخورد اصلاحی به تکالیف تولیدی زبا‌ن‌آموزان
                </li>
                </ol>
                INTRO,
                'intro_video' => 'sThC6',
                'main_link' => 'https://persiangrammar.saadifoundation.ir',
                'levels' => [
                    Level::firstWhere('title_abbr', 'a'),
                ],
                'tags' => null,
            ],
            //vajeh-yabi
            [
                'title' => 'نرم افزار واژه یابی',
                'title_abbr' => 'vajeh-yabi',
                'icon' => 'icons/vajeh-yabi.png',
                'intro' => <<<INTRO
                <p>
                نرم ‎ افزار واژه ‎ یابی یک ابزار کمک ‎ آموزشی برای همه کسانی است که می ‎ خواهند دامنه لغات زبان فارسی خود را تقویت کنند. همه کسانی که با زبان فارسی در حد پیش‌میانی و بالاتر آشنا باشند، می‌‏توانند با استفاده از این نرم ‎ افزار، واژه ‎ های بسیاری را در درون جملات صحیح بیاموزند. محتوای این نرم ‎ افزار برای زبان ‎ آموزان سطح پیش ‎ میانی و میانی مناسب است که در دوازده حوزه واژگانی، مجموعاً ۱۸۰ گام دارد. هر حوزه واژگانی به تعداد ۵ ± ۱۵ گام دارد که در هر گام زبان‌آموز باید یک واژه را پیدا کند. در هر گام از بازی، کاربران به کمک عنوان حوزه واژگانی و بافت جمله و تعداد خانه‌های خالی حروف و حروف ارائه‌شده در جدول حروف به پاسخ درست می ‎ رسند. در صورتی که کاربر موفق به پیدا‌کردن واژه موردنظر نشود، می ‎ تواند از بخش راهنما کمک بگیرد. در این بخش با کسر تعدادی امتیاز از کاربر، به وسیله یکی از این روش‌ها کاربر راهنمایی می ‎ شود: ارائه تصویر واژه موردنظر، ارائه معادل انگلیسی واژه، و ارائه توضیح فارسی در مورد واژه.
                </p>
                <h2>
                ویژگی‌های اصلی
                </h2>
                <ol>
                <li>
                یادگیری واژگان جدید
                </li>
                <li>
                سرگرمی
                </li>
                <li>
                یادگیری استفاده از واژه در جمله
                </li>
                <li>
                تطبیق واژه با تصویرش
                </li>
                </ol>
                INTRO,
                'intro_video' => null,
                'main_link' => 'https://cafebazaar.ir/app/com.navidokht.persian',
                'levels' => [
                    Level::firstWhere('title_abbr', 'a'),
                ],
                'tags' => null,
            ],
            //vajeh-bazi
            [
                'title' => 'نرم افزار واژه بازی ۱ و ۲',
                'title_abbr' => 'vajeh-bazi',
                'icon' => 'icons/vajeh-bazi.png',
                'intro' => <<<INTRO
                <p>
                واژه‌بازی به دو صورت یک نفره (مرحله ای) و رقابتی (آنلاین) طراحی شده‌است. واژه‌بازی یک بازی فکری است که نیازمند هوش بالا، حافظه قوی و آشنایی با کلمات مختلف فارسی است. در این بازی شما می‌بایست با کشیدن انگشت روی جدول، کلمات معنادار را پیدا کرده و به نسبت تعداد حروف آنها امتیاز کسب کنید. حالت یک‌نفره این بازی هم به‌صورت امتیازی و هم به‌صورت مرحله‌ای است، بنابراین هم می‌توانید با کسب امتیاز بالا رکورد خود را ثبت کنید و هم مراحل بازی را طی کنید تا به مرحله آخر برسید. در این بازی، ۴۵۵ مرحله وجود دارد که در هر مرحله سه کلمه خاص به شما ارائه می‌شود تا آنها را در جدول پیدا کنید، مرحله اول با کلمات ساده دوحرفی شروع می‌شود تا مرحله آخر که می‌بایست کلمات سخت چهارده‌حرفی را پیدا کنید. در حالت رقابتی در این بازی می‌توانید با کسب امتیاز به‌صورت آنلاین با دیگران رقابت کنید، چنانچه با کلمات فارسی بیشتری آشنایی داشته و همچنین از هوش بالاتر و حافظه قوی‌تری برخوردار باشید، می‌توانید رتبه بهتری کسب نمایید. در این حالت، در هر روز یک جدول مشترک به همه نمایش داده می‌شود و امتیازات کسب‌شده فقط مربوط به همان جدول است، بنابراین هر روز یک رقابت جدید با یک جدول جدید پیش رو خواهید داشت.
                </p>
                <h2>
                ویژگی‌های اصلی
                </h2>
                <ol>
                <li>
                یادگیری واژگان جدید
                </li>
                <li>
                سرگرمی و رقابت با سایر کاربران
                </li>
                </ol>
                INTRO,
                'intro_video' => null,
                'main_link' => 'https://play.google.com/store/apps/details?id=com.shahmiri.vazhehbazi',
                'levels' => [
                    Level::firstWhere('title_abbr', 'a'),
                ],
                'tags' => null,
            ],
            //vajeh-mina
            [
                'title' => 'نرم افزار واژه مینا',
                'title_abbr' => 'vajeh-mina',
                'icon' => 'icons/vajeh-mina.png',
                'intro' => <<<INTRO
                <p>
                نرم ‎ افزار مینا یک ابزار کمک ‎ آموزشی برای همه کسانی است که می ‎ خواهند دامنه لغات زبان فارسی خود را تقویت کنند. همه کسانی که با زبان فارسی در حد مبتدی آشنا باشند، می توانند با این نرم ‎ افزار واژه‌های زیادی بیاموزند. محتوای نرم ‎ ‌افزار شامل حدود ۱۲۰۰ واژه‏ است که جزء پرکاربردترین واژه‌های زبان فارسی هستند. این نرم‌افزار دوزبانه است. انتقال مفاهیم و آموزش با ارائه معادل انگلیسی واژه‌ها، آوانوشت آنها به همراه تصویر و صوت صورت می‌گیرد. در مجموع ۱۴ حوزه واژگانی و بیش از ۷۰ درس در نظر گرفته شده‌است. هر درس نیز ۱۰ نوع فعالیت را دربردارد که هر فعالیت شامل حدود ۲۰ تکلیف است؛ هر حوزه نیز آزمونی جداگانه دارد و امکان مرور درس‌ها فراهم گشته‌است. هر حوزه شامل چند درس است که کاربر با انتخاب یکی از درس‌ها وارد مرحله واژه‌آموزی و فعالیت ‎ ها می ‎ شود. در این مرحله ۱۰ نوع فعالیت وجود دارد که در تمام این فعالیت ‎ ها، کاربر واژه‌های آن درس مربوط را به شکل ‎ های متنوعی تکرار و تمرین می‌کند. هر کدام از این فعالیت‏ها با ویژگی خاصی طراحی شده‌است و اهداف خاصی دارند که چینش فعالیت‌ها، از فعالیت اول تا دهم از ساده به دشوار بوده ‎ است.
                </p>
                <h2>
                ویژگی‌های اصلی
                </h2>
                <ol>
                <li>
                یادگیری واژگان جدید
                </li>
                <li>
                سرگرمی
                </li>
                <li>
                تقویت چهار مهارت خواندن، نوشتن، گوش‌دادن و صحبت‌کردن
                </li>
                <li>
                نمایش نمودار پیشرفت کاربر
                </li>
                <li>
                ارزیابی عملکرد کاربر
                </li>
                </ol>
                INTRO,
                'intro_video' => null,
                'main_link' => 'https://saadifoundation.ir/file/download/download/1579076520-mina-avvalmarketrelease2.zip',
                'levels' => [
                    Level::firstWhere('title_abbr', 'b1'),
                    Level::firstWhere('title_abbr', 'b2'),
                    Level::firstWhere('title_abbr', 'b3'),
                ],
                'tags' => null,
            ],
            //videos
            [
                'title' => 'ویدیوهای آموزشی',
                'title_abbr' => 'videos',
                'icon' => 'icons/videos.png',
                'intro' => <<<INTRO
                <p>
                ویدئوهای آموزشی یکی از متداول‌ترین روش‌های آموزشی هستند که هم‌اکنون در بزرگترین سامانه‌های آموزش مجازی در دنیا مورد استفاده قرار می‌گیرند. تلفیق ویدئو با محتوا آموزشی با روش موشن‌گرافیک از جدیدترین وتخصصی‌ترین نوع ویدئوهای آموزشی است. جهت تولید این ویدئوها، هر جلسه کلاسی به چندین قطعه ویدئوی ۵ تا ۱۰ دقیقه‌ای تقسیم، و مطالب دوره در استودیوی بنیاد سعدی ضبط شده‌است. سپس یک متخصص آزفا و یک تکنولوژیست آموزشی متن تدریس را پیاده‌سازی می‌کنند و سناریوی ویدئو را می‌نویسند. سناریو تحویل تیم موشن‌گرافیک و تدوین فیلم قرار گرفته و پس از حداقل دو مرحله بازبینی و اصلاح در نهایت محتوایی غنی، که تلفیقی از ویدئوی استاد دوره و موشن‌گرافیک محتوای آموزشی است، تولید می‌گردد. علاوه بر این جهت پاسخگویی به نیاز فراگیران، زیرنویس فارسی ویدئو نیز تهیه می‌شود و همراه هر قطعه ارائه می‌گردد. از این ویدئوها هم به‌صورت مستقل و هم به‌عنوان محتوای اصلی دوره‌های مجازی غیرهمزمان استفاده می‌شود.
                </p>
                <p>
                در حال حاضر مجموعه ویدئوهای دوره غیرهمزمان روش تدریس زبان فارسی که شامل ۵۴ قطعه ویدئو و در مجموع حدود ۹ ساعت است، تهیه شده‌است. در مراحل بعدی، ویدئو‌های دوره‌های کوتاه‌مدت آموزشی و قطعه‌های کوتاه یادگیری ( Micro Learning ) در بنیاد سعدی نیز طراحی و تدوین خواهدشد.
                </p>
                <h2>
                ویژگی‌های اصلی
                </h2>
                <ol>
                <li>
                تقسیم درس به قطعات کوچک‌تر ۵ تا ۱۰ دقیقه‌ای
                </li>
                <li>
                استفاده از اساتید مطرح در زمینه آموزش زبان فارسی
                </li>
                <li>
                تلفیق ویدئوی تدریس استاد با موشن‌گرافیک محتوای آموزشی
                </li>
                <li>
                طراحی سناریو برای هر ویدئو توسط متخصصین آزفا و تکنولوژیست‌های آموزشی
                </li>
                <li>
                جذابیت بالای ویدئو به دلیل کوتاه‌بودن و داشتن موشن‌گرافیک
                </li>
                <li>
                ابلیت نمایش ویدئو به همراه زیرنویس فارسی
                </li>
                <li>
                عرضه با دو کیفیت بالا (جهت استفاده آفلاین) و پایین (استفاده تحت وب)
                </li>
                </ol>
                INTRO,
                'intro_video' => null,
                'main_link' => null,
                'levels' => null,
                'tags' => [
                    'how-to-teach'
                ],
            ],
            //e-books
            [
                'title' => 'کتاب های الکترونیکی',
                'title_abbr' => 'e-books',
                'icon' => 'icons/e-books.png',
                'intro' => <<<INTRO
                <p>
                کتاب ایران‌شناسی در قالب برنامه درسی محتوامحور تهیه و تدوین شده‌است. مخاطبان اصلی این کتاب دانشجویان خارجی رشته ایران‌شناسی و شرق‌شناسی و زبان‌آموزان سطوح میانی و فوق‌میانی هستند. همچنین کتاب لذت خواندن با بهره‌گیری از انگاره نیل اندرسون، به آموزش و تقویت مهارت خواندن می‌پردازد. این کتاب مناسب زبان‌آموزان سطوح پیش‌میانی و میانی است. بنیاد سعدی علاوه بر تألیف این دو کتاب و سی‌دی صوتی آموزشی آن، نسخه الکترونیکی آنها را نیز تهیه کرده‌است. این نسخه الکترونیکی چندرسانه‌ای به زبان‌آموز این امکان را می‌دهد که در صورت عدم‌دسترسی به کتاب بتواند متون کتاب را خوانده و به آنها گوش دهد. این نسخه الکترونیکی حاوی تمام متن‌های کتاب و فایل صوتی آنها است. زبان‌آموز در قسمت خانه، نام فصل‌ها و درس‌های آن را می‌بیند و می‌تواند درس موردنظر خود را انتخاب کند. زبان‌آموز علاوه بر گوش‌دادن به فایل صوتی، می‌تواند متن را مشاهده کند و همراه گوینده متن را بخواند. در صفحه مربوط به هر متن امکاناتی از جمله کلید توقف، جلو بردن و عقب بردن متن برای زبان‌آموز فراهم است.
                </p>
                <h2>
                ویژگی‌های اصلی
                </h2>
                <ol>
                <li>
                نتخاب درس‌ها به صورت دلخواه
                </li>
                <li>
                عقب بردن و جلو بردن متن برای درک بیشتر
                </li>
                <li>
                خواندن متن هم‌زمان با گوش کردن به آن
                </li>
                <li>
                گوش‌دادن به چند موسیقی ایرانی با موضوع ایران
                </li>
                <li>
                دیدن هم‌زمان متن شعر در هنگام گوش‌دادن به موسیقی
                </li>
                </ol>
                INTRO,
                'intro_video' => null,
                'main_link' => null,
                'levels' => null,
                'tags' => [
                    'enrichment',
                ],
            ],
            //books-audio
            [
                'title' => 'فایل صوتی کتاب های چاپی',
                'title_abbr' => 'books-audio',
                'icon' => 'icons/books-audio.png',
                'intro' => <<<INTRO
                <p>
                با توجه به نقش کلیدی مهارت شنیدن در مراحل اولیه زبان‌آموزی، برای هر یک از کتاب‌های بنیاد سعدی، مجموعه فایل‌های صوتی مرتبط نیز ضبط و آماده شده‌است. فایل‌های صوتی منطبق با اهداف آموزشی کتاب است و جهت کمک به انتقال یادگیری به دنیای واقعی از سبک گفتگوهای محاوره‌ای استفاده شده‌است.
                </p>
                <p>
                با راه‌اندازی استودیو در بنیاد سعدی، فایل‌های صوتی در این استودیو ضبط می‌گردد. جهت استفاده از این فایل‌ها می‌توان با اسکن کد مشخص در کتاب به سایت بنیاد سعدی متصل شد و فایل‌های مرتبط را دانلود کرد.
                </p>
                <h2>
                ویژگی‌های اصلی
                </h2>
                <ol>
                <li>
                به‌کارگیری روش‌های عملی جدید در گفتگو‌ها و بیان کلمات
                </li>
                <li>
                ضبط در استودیوی حرفه‌ای و کیفیت بالای فایل‌ها
                </li>
                <li>
                طراحی مبتنی با فعالیت‌های آموزشی کتاب
                </li>
                </ol>
                INTRO,
                'intro_video' => 'UqTJK',
                'main_link' => 'https://books.saadifoundation.ir',
                'levels' => null,
                'tags' => [
                    'enrichment',
                ],
            ],
            //synch-learning
            [
                'title' => 'آموزش برخط همزمان',
                'title_abbr' => 'synch-learning',
                'icon' => 'icons/synch-learning.png',
                'intro' => <<<INTRO
                <p>در راستای تسهیل آموزش زبان فارسی و گسترش آن، بنیاد سعدی امکان برگزاری کلاس‌های مجازی همزمان (synchronous) را فراهم آورده‌است. در این کلاس‌ها، استاد و دانشجو در یک زمان مشخص ولی در مکان دلخواه از طریق اینترنت وارد سامانه بنیاد سعدی می‌شوند و طبق راهنماهای موجود به کلاس متصل می‌شوند و شروع به فعالیت می‌نمایند. اساتید این دوره‌ها، متخصصین آزفا هستند. در هر کلاس، علاوه بر استاد یک تسهیل‌گر که دوره تخصصی آموزش در فضای مجازی را گذرانده است نیز حضور دارد. تسهیل‌گر علاوه بر حمایت استاد، فعالیت‌های یادگیرندگان حاضر در کلاس را نیز مدیریت نماید. علاوه بر استاد و تسهیل‌گر، پشتیبانان آموزشی و فنی نیز قبل و هنگام برگزاری دوره یادگیرندگان را جهت اتصال و حفظ ارتباط با دوره حمایت می‌کنند.</p>
                <p>هم‌اکنون امکان برگزاری دوره‌های مجازی همزمان در دو گروه آموزش زبان‌فارسی و روش تدریس زبان فارسی وجود دارد.</p>
                <h2>
                ویژگی‌های اصلی
                </h2>
                <ol>
                <li>
                حضور استاد و دانشجو در مکان‌های مختلف ولی در یک زمان مشخص به‌صورت زنده
                </li>
                <li>
                تدریس استاد به‌صورت تصویری و صوتی همراه با فایل ارائه
                </li>
                <li>
                ارائه بازخورد و پاسخ به سوالات در همان زمان برگزاری کلاس (Live)
                </li>
                <li>
                امکان گفتگوی زنده دانشجویان با استاد به‌صورت متنی، صوتی و تصویری
                </li>
                <li>
                ضبط کلاس و امکان مشاهده کلاس برگزارشده چند دقیقه پس از اتمام کلاس
                </li>
                <li>
                ارائه سایر منابع و محتوای تکمیلی در سامانه
                </li>
                <li>
                برگزاری آزمون دوره به‌صورت برخط
                </li>
                <li>
                ارائه گواهی قبولی به‌صورت برخط همراه با کد اعتبارسنجی بنیاد سعدی
                </li>
                </ol>
                INTRO,
                'intro_video' => null,
                'main_link' => 'https://core.saadifoundation.ir/product-category/courses/learn-persian/?lang=en',
                'levels' => null,
                'tags' => [
                    'infrastructure',
                ],
            ],
            //asynch-learning
            [
                'title' => 'آموزش برخط غیرهمزمان',
                'title_abbr' => 'asynch-learning',
                'icon' => 'icons/asynch-learning.png',
                'intro' => <<<INTRO
                ‌‌‌‌‌‌‌‌‌‌‌‌‌‌اصلی‌ترین ویژگی دوره‌های غیرهمزمان این است که لزومی ندارد زمان مشخصی برای حضور دانشجو و استاد در سامانه تعیین شود. به‌علاوه محتوای این دوره‌ها به دلیل نوع طراحی، غنی‌تر است و با کیفیت بالاتری نسبت به دوره‌های همزمان طراحی شده‌است. محتوای دوره‌های غیرهمزمان در بنیاد سعدی شامل ویدئوهای آموزشی تعاملی، متن ویدئوها، منابع مرتبط و آزمون آنلاین طراحی شده است. هر دوره غیرهمزمان شامل چندین جلسه و هر جلسه شامل چندین قسمت ویدئوی آموزشی است. جهت اطمینان از حفظ کیفیت آموزش، روش آموزشی در دوره‌های غیرهمزمان به‌صورت مرحله‌ای طراحی شده است؛ بدین گونه که در صورت مشاهده ویدئوها و قبولی در آزمون هر جلسه، امکان مشاهده محتوای جلسه بعدی فراهم می‌شود. در پایان جلسات نیز آزمونی از تمام محتوای دوره برگزار می‌گردد که تصحیح آن خودکار است و کاربر می‌تواند نتیجه آزمون را لحظاتی پس از آن مشاهده کند. گواهی دوره در صورت مشاهده تمام جلسات و کسب نمره قبولی در آزمون‌های مستمر و پایانی به‌صورت الکترونیکی صادر می‌شود. گواهی‌های صادرشده دارای کد و لینک اعتبارسنجی از طریق سایت بنیاد سعدی هستند. برای شرکت در دوره‌های غیرهمزمان نیازی به هماهنگی نیست و با ورود به سامانه و ثبت‌نام، در هر زمانی می‌توانید در دوره شرکت کنید.
                <h2>
                ویژگی‌های اصلی
                </h2>
                <ol>
                <li>عدم‌محدودیت زمانی و مکانی جهت شرکت در دوره</li>
                <li>تعداد نامحدود شرکت‌کنندگان در دوره</li>
                <li>محتوای اصلی به‌صورت ویدئوهای آموزشی غنی و با کیفیت</li>
                <li>طراحی ویدئوها به‌صورت تعاملی همراه با پرسش هنگام پخش هر ویدئو</li>
                <li>ارائه متن گفتاری هر ویدئو جهت تسهیل در یادگیری</li>
                <li>برگزاری آزمون پس از هر جلسه و ارائه نمره آزمون پس از اتمام آزمون و ارائه بازخورد اطلاعاتی و پاسخ تشریحی آزمون‌های هر جلسه</li>
                <li>ارسال تکلیف و دریافت بازخورد (در برخی از دوره‌ها)</li>
                <li>همتاارزیابی دانشجویان از همدیگر (در برخی از دوره‌ها)</li>
                </ol>
                INTRO,
                'intro_video' => '6NHPZ',
                'main_link' => 'https://s1f.ir/vttc2',
                'levels' => null,
                'tags' => [
                    'how-to-teach',
                ],
            ],
            //sflc
            [
                'title' => 'سامانه مدیریت آموزش',
                'title_abbr' => 'sflc',
                'icon' => 'icons/sflc.png',
                'intro' => <<<INTRO
                <p>
                سامانه مدیریت آموزشی بنیاد سعدی، وب‌گاهی برای ثبت‌نام زبان‌آموزان و مدرسان زبان فارسی و شرکت در دوره‌های بنیاد سعدی است. کاربران در این وب‌گاه می‌توانند اطلاعات موردنیاز بنیاد سعدی در دوره‌های مختلف را در پرسشنامه ده‌صفحه‌ای وارد کرده، تصویر مدارک خود را آپلود کنند و در دوره‌های تعریف‌شده ثبت‌نام کنند. همچنین کارشناسان و کارمندان بنیاد سعدی بر حسب سطح دسترسی خود، می‌توانند فهرست‌های مختلفی از کاربران سامانه استخراج کنند. امکان واریز هزینه ریالی دوره‌ها به صورت آنلاین یا وارد کردن فیش بانکی، تأیید یا عدم‌تأیید آموزشی و مالی کاربران و نوبت‌گیری جهت آزمون آنلاین دوره‌ها از دیگر امکانات این وب‌گاه است. همچنین در بخش «متولیان زبان فارسی» موسسه‌های متولی آموزش زبان فارسی می‌توانند اطلاعات خود را وارد کنند و در اختیار کاربران قرار دهند.
                </p>
                <h2>
                ویژگی‌های اصلی
                </h2>
                <ol>
                <li>
                ثبت‌نام و تکمیل مشخصات و آپلود تصویر مدارک
                </li>
                <li>
                ثبت‌نام در دوره‌ها بر اساس ظرفیت دوره، مهلت ثبت‌نام، رعایت پیش‌نیازها و کامل‌کردن مشخصات لازم
                </li>
                <li>
                گرفتن نوبت برای آزمون آنلاین دوره‌ها
                </li>
                <li>
                سطوح دسترسی مختلف بر اساس نوع کاربر و نام صفحه
                </li>
                <li>
                پرداخت آنلاین ریالی
                </li>
                <li>
                بررسی اطلاعات کاربر و تأیید یا عدم‌تأیید او جهت شرکت در دوره
                </li>
                <li>
                بخش متولیان آموزش زبان فارسی
                </li>
                </ol>
                INTRO,
                'intro_video' => null,
                'main_link' => 'https://core.saadifoundation.ir/courses',
                'levels' => null,
                'tags' => [
                    'infrastructure',
                ],
            ],
            //amfa
            [
                'title' => 'آزمون مهارت زبان فارسی',
                'title_abbr' => 'amfa',
                'icon' => 'icons/amfa.png',
                'intro' => <<<INTRO
                <p>
                آزمون مهارت زبان فارسی ( Persian Language Proficiency Test (PLPT ) ، نوعی آزمون مهارت زبانی است که بدون توجه به سابقه آموزشی فرد آزمون‌دهنده، میزان توانایی او را در چهار مهارت اصلی زبان فارسی مورد ارزیابی قرار می‌دهد.
                </p>
                <p>
                آزمون «آمفا» در دو گونه عمومی ( General ) و دانشگاهی ( Academic ) برگزار می‌شود. برگزاری آمفای دانشگاهی به‌عنوان معیار پذیرش داوطلبان خارجی جهت تحصیل در دانشگاه‌های ایران بر عهده سازمان سنجش آموزش کشور و برگزاری آمفای عمومی برای سایر اهداف و کارکردها بر عهده بنیاد سعدی است.
                </p>
                <p>
                لذا سامانه الکترونیکی برگزاری آزمون و اعلام نتایج بر اساس سامانه‌های استاندارد آزمون‌های زبان مانند آیلتس، طراحی و راه‌اندازی شد. در این سامانه امکان تعیین شعبه‌های بین‌المللی برگزاری آزمون وجود دارد و تمام فرآیند ثبت اطلاع‌رسانی مراکز آزمون، ثبت‌نام و پرداخت وجه، صدور کارت ورود به جلسه و اعلام نتایج به‌صورت مجازی صورت می‌گیرد. با توجه به نوع آزمون، طراحی این سامانه به‌صورت مستقل با دامنه amfa.ir صورت گرفته‌است.
                </p>
                <h2>
                ویژگی‌های اصلی
                </h2>
                <ol>
                <li>
                وبگاه مستقل
                </li>
                <li>
                صدور مدرک معتبر درخصوص سطح زبانی داوطلبان
                </li>
                <li>
                امکان اعتبارسنجی برخط مدرک از طریق وبگاه آمفا
                </li>
                <li>
                امکان پرداخت هزینه به صورت ارزی و ریالی
                </li>
                <li>
                امکان درج نشان مراکز آزمون در کارنامه نهایی آمفا
                </li>
                <li>
                امکان برگزاری آزمون به درخواست و سفارش بخش‌های خصوصی و دولتی
                </li>
                <li>
                تعیین سطح زبان در چهار مهارت زبانی
                </li>
                <li>
                معتبر بودن مدرک تا سه سال
                </li>
                </ol>
                INTRO,
                'intro_video' => 'r9ZQg',
                'main_link' => 'https://amfa.ir',
                'levels' => null,
                'tags' => [
                    'test',
                ],
            ],
            //datfa
            [
                'title' => 'آزمون دانش تدریس داتفا',
                'title_abbr' => 'datfa',
                'icon' => 'icons/datfa.png',
                'intro' => <<<INTRO
                <p>
                آزمون دانش تدریس ( Teaching Knowledge Test ) به منظور سنجش دانش مدرسان زبان‌فارسی به غیرفارسی‌زبانان طراحی شده‌است و دانش آنها نسبت به مفاهیم مرتبط با زبان، استفاده از زبان و تدریس آن را مورد ارزیابی قرار می‌دهد. این آزمون دارای ۵ حوزه یا بخش است. چینش و ترتیب خاصی برای این ۵ حوزه در نظر گرفته نشده‌است و آزمون‌دهندگان می‌توانند هربار در آزمون یک یا چند حوزه شرکت کنند. به غیر از آزمون کاربردی دانش تدریس، سایر آزمون‌ها به‌صورت عینی و معمولاً در قالب پرسش‌های چندگزینه‌ای و وصل‌کردنی طراحی می‌شوند. هر حوزه شامل ۸۰ پرسش است و برای پاسخ‌گویی به هر حوزه ۸۰ دقیقه زمان در نظر گرفته شده‌است. تمامی پرسش‌ها در این آزمون دارای امتیاز برابر هستند و در قالب‌های وصل‌کردنی، چندگزینه‌ای، مرتب‌سازی و پیداکردن جواب نامرتبط طرح شده‌اند. برای شرکت در این آزمون، به هیچ نوع پیشینه حرفه‌ای (مانند سابقه تدریس) نیازی نیست، اما توصیه می‌شود که حداقل دانش زبانی شرکت‌کنندگان، سطح میانی باشد. سامانه الکترونیکی ثبت‌نام و اعلام نتایج آزمون داتفا در بنیاد سعدی طراحی و به بهره برداری رسیده‌است.
                </p>
                <h2>
                ویژگی‌های اصلی
                </h2>
                <p>
                این آزمون در ۵ حوزه اجرا می‌شود
                </p>
                <ol>
                <li>
                زبان و پیشینه یادگیری و آموزش آن
                </li>
                <li>
                طراحی درسی و استفاده از منابع آموزش زبان
                </li>
                <li>
                مدیریت فرایند آموزش و یادگیری
                </li>
                <li>
                زبان‌آموزان غیربزرگسال
                </li>
                <li>
                آزمون کاربردی دانش تدریس
                </li>
                </ol>
                INTRO,
                'intro_video' => null,
                'main_link' => null,
                'levels' => null,
                'tags' => [
                    'test',
                ],
            ],
            //corpus
            [
                'title' => 'پیکره بین‌المللی بنیاد سعدی',
                'title_abbr' => 'corpus',
                'icon' => 'icons/corpus.png',
                'intro' => <<<INTRO
                <p>
                پیکره به مجموعه‌ای از داده‌های طبیعی زبان گفته می‌شود. پیکره زبان‌آموز مجموعه داده‌های زبانی تولیدشده توسط کسانی است که در حال یادگیری یک زبان هستند. به کمک پیکره‌های زبان‌آموز می‌توان روند یادگیری یک زبان را شناسایی کرد و برای آموزش بهتر آن زبان برنامه‌ریزی کرد. نرم‌افزار پیکره زبان‌آموز بنیاد سعدی، نرم‌افزاری است تحت وب برای ورود و مدیریت متون تولیدی فارسی‌آموزان. در این نرم‌افزار می‌توان متون فارسی‌آموزان را از سطح آوایی تا نحوی برچسب‌گذاری کرد و بر اساس پارامترهای مختلف در آن به جستجو پرداخت. تاکنون حدود ۲۷۰۰ متن (حدوداً ۴۳۵ هزار واژه) از فارسی‌آموزان بنیاد سعدی، کالج بین‌الملل دانشکده علوم پزشکی دانشگاه تهران و جامعه المصطفی در این نرم‌افزار وارد شده‌است.
                </p>
                <p>
                پیکره زبان‌آموز بنیاد سعدی اکنون در حال توسعه است و به‌زودی مطابق با «دستور وابستگی جهانی» توسعه می‌یابد. دسترسی به این نرم‌افزار و داده‌های آن برای پژوهشگران از طریق مکاتبه با بنیاد سعدی امکان‌پذیر است.
                </p>
                <h2>
                ویژگی‌های اصلی
                </h2>
                <ol>
                <li>
                تایپ متن زبان‌آموز به همراه فراداده‌ها (Metadata) : نوع آزمون، موضوع متن، ملیت نویسنده، نمره، سطح نویسنده
                </li>
                <li>
                افزودن فراداده‌های جدید
                </li>
                <li>
                برچسب‌زنی متون در سطح حرف، واژه، جمله و عبارت
                </li>
                <li>
                افزودن برچسب‌های جدید
                </li>
                <li>
                جستجو و دیدن متن بر اساس نوع برچسب، سطح زبان‌آموز و نوع متن
                </li>
                <li>
                تعریف سطح دسترسی عادی و مدیریتی
                </li>
                </ol>
                INTRO,
                'intro_video' => null,
                'main_link' => 'https://sfcorpus.ir',
                'levels' => null,
                'tags' => [
                    'infrastructure',
                ],
            ],
            //library
            [
                'title' => 'نرم افزار مدیریت و جستجوی کتابخانه',
                'title_abbr' => 'library',
                'icon' => 'icons/library.png',
                'intro' => <<<INTRO
                <p>
                کتابخانه بنیاد سعدی گنجینه‌ای از کتاب‌های آموزش زبان فارسی به غیرفارسی‌زبانان و دیگر کتاب‌های مرتبط با این علم است. این کتابخانه شامل کتاب و دیگر منابع آموزشی است. نرم‌افزار آفلاین کتابخانه‌ بنیاد سعدی، قابلیت ثبت و ذخیره‌ اطلاعات هر کتاب بر اساس استانداردهای کتابداری (نام کتاب، نویسندگان، ناشر، شماره، موضوعات و…)، جستجو در کتاب‌ها، عضویت افراد در کتابخانه و ثبت و مدیریت امانت‌دهی کتاب‌ها را دارد. پژوهشگران با حضور در بنیاد سعدی و مراجعه به مسئول کتابخانه می‌توانند کتاب یا کتاب‌های موردنظر خود را انتخاب کنند و بر اساس قوانین کتابخانه، امانت بگیرند.
                </p>
                <p>
                این نرم‌افزار در نسخه‌های آینده به‌صورت تحت وب عرضه و با دیگر نرم‌افزارهای بنیاد سعدی یکپارچه خواهد شد.
                </p>
                <h2>
                ویژگی‌های اصلی
                </h2>
                <ol>
                <li>
                ثبت و ویرایش اطلاعات هر کتاب
                </li>
                <li>
                جستجو در کتاب‌ها
                </li>
                <li>
                ثبت اطلاعات اعضای کتابخانه
                </li>
                <li>
                جستجو در میان اعضای کتابخانه
                </li>
                <li>
                مدیریت امانت‌دهی کتاب‌ها
                </li>
                </ol>
                INTRO,
                'intro_video' => null,
                'main_link' => null,
                'levels' => null,
                'tags' => [
                    'infrastructure',
                ],
            ],
            //bibliography
            [
                'title' => 'نرم افزار کتاب شناسی آزفا',
                'title_abbr' => 'bibliography',
                'icon' => 'icons/bibliography.png',
                'intro' => <<<INTRO
                <p>
                طرح نرم‌افزار کتاب‌شناسی آزفا (آموزش زبان فارسی) با هدف جمع‌آوری اطلاعات همه کتاب‌های آموزش زبان فارسی به غیرفارسی‌زبانان از گذشته تاکنون بر اساس کتاب «کتاب‌شناسی توصیفی آزفا» (محمد دبیرمقدم، مهری قره‌گزی و مهرداد اصغرپور ماسوله، ۱۳۹۶) تهیه شده‌است. در این نرم‌افزار تحت وب، پژوهشگران می‌توانند اطلاعات دسته‌بندی‌شده‌ای از کتاب‌ها و منابع آزفا به همراه جلد هر کتاب را ببینند و به جستجو در آن بپردازند.
                </p>
                <p>
                در مرحله بعدی، این کتاب‌ها (تا حد امکان) برای کتابخانه بنیاد سعدی تهیه می‌شوند و پژوهشگران می‌توانند با حضور در بنیاد سعدی، این کتاب‌ها را مطالعه کنند.
                </p>
                <h2>
                ویژگی‌های اصلی
                </h2>
                <ol>
                <li>
                مشاهده اطلاعات طبقه‌بندی‌شده هر کتاب به همراه جلد آن
                </li>
                <li>
                جستجو در میان اطلاعات کتاب‌ها
                </li>
                <li>
                دسترسی به نرم‌افزار از طریق اینترنت (سایت بنیاد سعدی)
                </li>
                </ol>
                INTRO,
                'intro_video' => null,
                'main_link' => null,
                'levels' => null,
                'tags' => [
                    'how-to-teach',
                ],
            ],
            //studio
            [
                'title' => 'استودیوی فیلمبرداری و صدابرداری',
                'title_abbr' => 'studio',
                'icon' => 'icons/studio.png',
                'intro' => <<<INTRO
                <p>
                لازمه فعالیت‌های آموزش مجازی و تولید محتوای الکترونیکی، تهیه فیلم، صدا و تصویر با کیفیت است؛ لذا جهت تسهیل تولید باکیفیت محتوای الکترونیکی در چارچوب استانداردها و روش‌های علمی، استودیوی فیلم‌برداری و صدا‌برداری در بنیاد سعدی طراحی و تجهیز گردید. این استودیو به‌صورت چندکاربرده است و هم‌اکنون برای تولید ویدئوهای آموزشی، ضبط صدا، برگزاری دوره مجازی همزمان، مصاحبه‌ها و پادکست مورد استفاده قرار می‌گیرد.
                </p>
                <p>
                مجموعه تجهیزات استودیو، که شامل دوربین فیلم‌برداری، دستگاه ضبط صدا و میکروفون با سیم و بی‌سیم حرفه‌ای، نمایشگر متن برای مدرس، پروژکتورهای سافت باکس، پرده کروماکی، دیوارها، کف و سقف عایق صدا و آکوستیک است، با نظر متخصصین و افرد با تجربه تهیه شده‌است.
                </p>
                <p>
                با توجه به هدف بنیاد سعدی در گسترش زبان فارسی در جهان، علاوه بر استفاده متخصصین بنیاد سعدی، همکاران و سایر متخصصین آزفا در مراکز دیگر نیز از امکانات استودیو استفاده می‌کنند.
                </p>
                <h2>
                ویژگی‌های اصلی
                </h2>
                <ol>
                <li>
                طراحی در چارچوب استانداردهای فیلم‌برداری و صدابرداری
                </li>
                <li>
                تجهیزات حرفه‌ای جهت تولید ویدئو و صدای با‌کیفیت
                </li>
                <li>
                امکان برگزاری دوره‌های مجازی همزمان با کیفیت بالای ارائه توسط استاد
                </li>
                <li>
                استفاده از کروماکی جهت حذف پس‌زمینه مدرس و قراردادن محتوای آموزشی مناسب
                </li>
                </ol>
                INTRO,
                'intro_video' => 'ugB3o',
                'main_link' => null,
                'levels' => null,
                'tags' => [
                    'infrastructure',
                ],
            ],
        ];
        foreach ($options_data as $option_data) {
            $option = new Option;
            $option->title = $option_data['title'];
            $option->title_abbr = $option_data['title_abbr'];
            $option->icon = $option_data['icon'];
            $option->intro = $option_data['intro'];
            $option->intro_video = $option_data['intro_video'];
            $option->main_link = $option_data['main_link'];
            $option->save();

            if ($option_data['levels'] !== null) {
                $option->levels()->saveMany($option_data['levels']);
            }

            if ($option_data['tags'] !== null) {
                foreach ($option_data['tags'] as $tag) {
                    $option->tags()->save(Tag::firstWhere('title_abbr', $tag));
                }
            }
        }
    }
}
